IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE02.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-AMOUNT     PIC 9(5) VALUE 01000.
01  WS-RESULT     PIC X(10).

PROCEDURE DIVISION.
MAIN.
  IF WS-AMOUNT = 0
    MOVE 'ZERO' TO WS-RESULT
  ELSE
    MOVE 'POS' TO WS-RESULT
  END-IF

  EVALUATE TRUE
    WHEN WS-AMOUNT >= 10000
      DISPLAY 'HIGH'
    WHEN OTHER
      DISPLAY 'NORMAL'
  END-EVALUATE
GOBACK.
