IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE06.

DATA DIVISION.
WORKING-STORAGE SECTION.
*ループ用の添字
01  I            PIC 9(2) VALUE 1.
*長さ3の文字列を3要素分持つ配列。要素には (1), (2), (3) でアクセス
01  TABLE-KEYS   OCCURS 3 TIMES PIC X(3).

PROCEDURE DIVISION.
MAIN.
*MOVE 文で配列に値を代入
  MOVE 'A01' TO TABLE-KEYS (1)
  MOVE 'A02' TO TABLE-KEYS (2)
  MOVE 'A03' TO TABLE-KEYS (3)

*I を 1 から 1 ずつ増やし、I > 3 になったら終了するループ（各回でTABLE-KEYS(I)をDISPLAYして出力）
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
    DISPLAY 'KEY(' I ')=' TABLE-KEYS (I)
  END-PERFORM

GOBACK.
